In [1]:
import numpy as np
import pandas as pd

s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])
s1

a    0
b    1
dtype: int64

In [2]:
s2

c    2
d    3
e    4
dtype: int64

In [3]:
s3

f    5
g    6
dtype: int64

In [5]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [6]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                   index=['a', 'b', 'c'],
                   columns=['one','two'])

df1

   one  two
a    0    1
b    2    3
c    4    5

In [7]:
df2 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three','four'])
df2

   three  four
a      0     1
c      2     3

In [8]:
pd.concat([df1, df2])

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    0.0   1.0
c  NaN  NaN    2.0   3.0

In [10]:
df3 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['e', 'f'],
                   columns=['one','two'])
df3

   one  two
e    0    1
f    2    3

In [12]:
pd.concat([df1, df3])

   one  two
a    0    1
b    2    3
c    4    5
e    0    1
f    2    3

In [13]:
df4 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['a', 'b'],
                   columns=['one','two'])

In [14]:
pd.concat([df1, df4])

   one  two
a    0    1
b    2    3
c    4    5
a    0    1
b    2    3

In [15]:
df1 = pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1':range(7)})
df2 = pd.DataFrame({'key':['a', 'b', 'd'],
                   'data2':range(3)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [16]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [17]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0